WiKi/src/SECTIONS/TEX/MATERIAL_POINT_METHOD/Material_Point_Method.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-02 dom 19:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Material Point Method</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Miguel Molinos Pérez" />
</head>
<body>
<div id="content">
<h1 class="title">Material Point Method</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org901a738">Initial discretization</a></li>
<li><a href="#orgf1cfa1f">Discrete Solution Procedure</a></li>
<li><a href="#org95e1714">Explicit MPM Scheme</a></li>
<li><a href="#org9e10b7e">Large strain formulation for the material-point-method</a>
<ul>
<li><a href="#org35ab4b0">Tracking large deformation</a></li>
<li><a href="#org5d3a221">Large strain analysis by the material point method}</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="../index.html">Main page of GeHoJerez</a>
</p>

<div id="outline-container-org901a738" class="outline-2">
<h2 id="org901a738">Initial discretization</h2>
<div class="outline-text-2" id="text-org901a738">
<p>
The particle characteristic function are required to be a partition of
unity in the initial configuration :
</p>
\begin{equation}
  \label{eq:part_uniti_chi_i}
  \sum_{p=1}^{Np}\chi_p^i(x)\ =\ 1
\end{equation}

<p>
Where \(\chi_p^i\) denotes the particle characteristic functions
restricted to their initial positions and undeformed state. In the
simplest cases, particle characteristic function are taken to be
initially non-overlapping. However, nothing precludes overlapping, or
''fuzzy'' particles, as discussed later. Initial particle volumes
\(V_p^i\) are defined by :
</p>
\begin{equation}
  \label{eq:vpi_def}
  V_p^i = \int_{\Omega^i}\chi^i_p(x)\ d\Omega
\end{equation}
<p>
where \(\Omega^i\) is the initial volume of the continuum body to be
discredited. In addition to initial particle volumes, the material
point initial masses, \(m_p^i\), momenta, \(p_p^i\) ans stresses,
\(\sigma_p^i\), must be defined. These properties of the continuum
against the particle characteristic functions:
</p>

\begin{align}
  \label{eq:m_pi}
  m_p^i =& \int_{\Omega_i}\rho^i(x)\chi_p^i(x)\ d\Omega \\
  \label{eq:p_pi}
  p_p^i =& \int_{\Omega_i}\rho^i(x)v^i(x)\chi_p^i(x)\ d\Omega
\end{align}

<p>
where \(\rho^i_p\)
</p>
</div>
</div>

<div id="outline-container-orgf1cfa1f" class="outline-2">
<h2 id="orgf1cfa1f">Discrete Solution Procedure</h2>
<div class="outline-text-2" id="text-orgf1cfa1f">
<p>
Given a material point property, \(f_p\), a representation consistent
with the initial discretization procedure is the sum over the material
points.
</p>
\begin{equation}
f(x) = \sum_p^{Np}f_p \chi_p(x)  
\end{equation}

<p>
The particle characteristic functions are used as a basis for
representing particle data throughout the computational domain and
determine the degree of smoothness of the spatial variation.
</p>

<p>
Approaching term by term of the balance of momentum using the discretization procedure of the MPM , we get the following :
</p>

<ul class="org-ul">
<li><p>
Acceleration term :
</p>
\begin{eqnarray}
\int_{\Omega} \psi^T \rho \cdot a \cdot d\Omega =& \int_{\Omega} \psi^T \frac{m}{V}
\dot{v}\ d\Omega = \int_{\Omega} \psi^T \frac{1}{V}
\overbrace{m\dot{v}}^{\dot{p}}\ d\Omega = \int_{\Omega} \psi^T \frac{\dot{p}}{V} d\Omega = \nonumber \\
=&  \int_{\Omega} \psi^T \left[ \sum^{Np}_{p=1} \frac{\dot{p}_p}{V_p} \chi_p(x) \right]\ d\Omega =
\sum^{Np}_{p=1} \left[ \int_{\Omega_p \bigcap \Omega}
\psi^T\frac{\dot{p}_p}{V_p}\chi_p(x)\ d\Omega \right] 
\end{eqnarray}</li>

<li><p>
Internal forces :
</p>
\begin{align}
\int_{\Omega}  \nabla \psi^T \sigma\ d\Omega = \int_{\Omega}  \nabla
\psi^T \left[\sum^{Np}_{p=1} \sigma_p \chi_p(x) \right]\ d\Omega =
\sum^{Np}_{p=1} \left[ \int_{\Omega_p \bigcap \Omega}
\nabla\psi^T\sigma_p\chi_p(x)\ d\Omega \right]
\end{align}</li>
<li>External forces :</li>
</ul>
\begin{align}
\int_{\Omega} \psi^T \rho b\ d\Omega =& \int_{\Omega} \psi^T \frac{m}{V} b\
d\Omega = \int_{\Omega} \psi^T \left[ \sum^{Np}_{p=1}
\frac{m_p}{V_p}\chi_p(x) \right] b\ d\Omega = \sum_{p=1}^{Np}
\left[ \int_{\Omega_p \bigcap \Omega}
\psi^T \frac{m_p}{V_p} \chi_p(x) b\ d\Omega \right]
\end{align}  

<p>
Finally we get the balance of momentum with the GIPM :
</p>

\begin{align}
\sum^{Np}_{p=1} \left[  \int_{\Omega_p \bigcap \Omega}
\psi^T\frac{\dot{p}_p}{V_p}\chi_p(x)\ d\Omega \right] + \sum^{Np}_{p=1} \left[ \int_{\Omega_p \bigcap \Omega}
\nabla\psi^T\sigma_p\chi_p(x)\ d\Omega \right] =
\int_{\Gamma}\psi^T t\ d\Gamma + \sum_{p=1}^{Np}
\left[ \int_{\Omega_p \bigcap \Omega}
\psi^T \frac{m_p}{V_p} \chi_p(x) b\ d\Omega \right]
\end{align}

<p>
where \(\Omega_p\) denotes the current support of particle
characteristic function p, and the current particle volumes are
defined by :
</p>
\begin{equation}
V_p = \int_{\Omega_p \bigcap \Omega} \chi_p(x)\ d\Omega
\end{equation}

<p>
Rewriting the balance of momentum, the equation 
</p>

<p>
The other fundamental aspect of PIC methods is the use of a
computational grid. In MPM the grid serves as a scratch pad for the
solution of conservation of momentum, from which particle states are
updated. To complete the discretization procedure, approximations to
the admissible velocity fields, or test functions, are introduced in
terms of grid vertex quantities and grid shape functions. This step is
analogous to the development of FEM discrete equations. However, use
of both grid and particle basis functions to represent test functions
and trial functions, respectively, is a Petrov–Galerkin method,
[Johnson (1987)], and therefore more akin to some of the meshless
methods (in particular [Demkowicz and Oden (1986); Atluri and Zhu
(2000)]) than the FEM. The continuous representation, \(g(x)\), of grid
data, \(g_i\) , then
</p>
\begin{equation}
g(x) = \sum_{i = 1}^{Nn}=g_iN_i(x)
\end{equation}

<p>
Here \(N_i(x)\) is a computational grid shape function, which takes unit
value at node \(i\) and zero value all the other nodes. Further, the
shape function are required to be a partition of unity
</p>

\begin{equation}
\sum_{i=1}^{Nn} N_i(x) = 1
\end{equation}

\begin{eqnarray}  
\sum^{Np}_{p=1} \left[ \int_{\Omega_p \bigcap \Omega}
\psi^T\frac{\dot{p}_p}{V_p}\chi_p(x) d\Omega \right] =& \sum^{Np}_{p=1}\left[ \frac{1}{V_p}\int_{\Omega_p \bigcap \Omega} N_i(x) \chi_p(x) d\Omega \dot{p}_p  \right] = \nonumber \\
=& \sum_{p=1}^{Np} \overline{S}_{ip}\cdot \dot{p}_p = \dot{p}_i
\end{eqnarray}

\begin{eqnarray}
-\sum^{Np}_{p=1}\left[ \int_{\Omega_p \bigcap \Omega}\nabla\psi^T \sigma_p \chi_p  d\Omega \right] =& -\sum^{Np}_{p=1}\left[ \int_{\Omega_p \bigcap \Omega}\nabla N_i(x) \sigma_p \chi_p  d\Omega \right] = \nonumber \\
=& - \sum^{Np}_{p=1}\left[ \frac{V_p}{V_p} \int_{\Omega_p \bigcap \Omega}\nabla N_i(x) \chi_p  d\Omega \sigma_p \right] = \nonumber \\
=& - \sum^{Np}_{p=1}\left[V_p\overline{\nabla S}_{ip} \sigma_p \right] = f_i^{int}
\end{eqnarray}

\begin{equation}
\int_{\Gamma \equiv \partial \Omega} \psi^T t d\Gamma = \int_{\Gamma \equiv \partial \Omega} N_i(x) t d\Gamma = f_i^t
\end{equation}

\begin{eqnarray}
\sum_{p=1}^{Np} \left[ \int_{\Omega_p \bigcap \Omega} \psi^T \frac{m_p}{V_p} \chi_p(x) b d\Omega \right] = \sum_{p=1}^{Np} \left[ \int_{\Omega_p \bigcap \Omega} N_i(x)  \frac{m_p}{V_p} \chi_p(x) b d\Omega  \right] =  \sum_{p=1}^{Np} \overline{S}_{ip}b m_p = f_i^b  
\end{eqnarray}


\begin{eqnarray}
\sum_{p=1}^{Np} \overline{S}_{ip}\cdot \dot{p}_p  =
-\sum^{Np}_{p=1}\left[V_p\overline{\nabla S}_{ip} \sigma_p \right]
+&  \int_{\Gamma \equiv \partial \Omega} N_i(x) t d\Gamma \nonumber
+& \sum_{p=1}^{Np} \overline{S}_{ip}b m_p \nonumber\\
\Downarrow&  \\
\dot{p}_p = f_i^{int} + f_i^t + f_i^b \nonumber
\end{eqnarray}
</div>
</div>

<div id="outline-container-org95e1714" class="outline-2">
<h2 id="org95e1714">Explicit MPM Scheme</h2>
<div class="outline-text-2" id="text-org95e1714">
<ol class="org-ol">
<li>Calculate the grid nodal mass and momentum by maping the particle mass and momentum to the corresponding grid nodes.
<ul class="org-ul">
<li><p>
Get the nodal mass \(m_I^k\)
</p>
\begin{equation}
m_{I}^{k} = \sum^{n_p}_{p=1} m_p N_{Ip}^{k}
\end{equation}</li>
<li><p>
Get the nodal momentum \(p_{I,i}^{k-1/2}\)
</p>
\begin{equation}
p_{I,i}^{k-1/2} = \sum^{n_p}_{p=1} m_p v_{ip}^{k-1/2}N_{Ip}^{k}
\end{equation}</li>
</ul></li>
<li>Impose essential boundary conditions on the grid nodal momentum. At the fixed boundary, set \(p_{iI}^{k-1/2} = 0\).</li>
<li>For the USF only, calculate the particle strain increment \(\Delta \epsilon_{ijp}^{k-1/2}\), and the update the particle density and stress as follows:
<ul class="org-ul">
<li><p>
Calculate the grid nodal velocity \(v_{iI}^{k-1/2}\)
</p>
\begin{equation}
v_{iI}^{k-1/2} = \frac{p_{iI}^{k-1/2}}{m_I^k}
\end{equation}</li>
<li><p>
Calculate the particle strain increment \(\Delta \epsilon_{ijp}^{k-1/2}\) with :
</p>
\begin{equation}
\Delta \epsilon_{ijp}^{k-1/2} = \frac{1}{2}(N_{Ip,j}^{k} v_{iI}^{k-1/2} + N_{Ip,i}^{k} v_{jI}^{k-1/2})
\end{equation}</li>
<li><p>
Update the particle density with :
</p>
\begin{equation}
\rho_p^{k+1} = \frac{\rho_p^k}{1 + \Delta\epsilon_{iip}^{k-1/2}}
\end{equation}</li>
<li>Update the particle stress stated based on \(\Delta_{ijp}^{k-1/2}\) with an appropriate constitutive law.</li>
<li></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org9e10b7e" class="outline-2">
<h2 id="org9e10b7e">Large strain formulation for the material-point-method</h2>
<div class="outline-text-2" id="text-org9e10b7e">
</div>
<div id="outline-container-org35ab4b0" class="outline-3">
<h3 id="org35ab4b0">Tracking large deformation</h3>
<div class="outline-text-3" id="text-org35ab4b0">
<p>
The geometric area associated with a material point is the given the notion <code>voxel</code>. 
In the reference configuration, the voxel is defined such that \(V_p\) corresponds to 
the size of the <code>voxel</code>. The <code>voxel</code> notion, was introduced by
\cite{Steffen2008}. The location of the corners associated with each
voxel at a deformed state is specified through the
deformation-gradient tensor which needs to be tracked throughout the
simulation.
Adopting this concept, a deformation gradient is associated with each
material point in the current state as
</p>
\begin{equation}
F_p = \frac{\partial x_p}{\partial x^0} = \frac{1}{V_p^0}
\int_{\Omega_p^0}F(x)\ d\Omega  
\end{equation}

<p>
In the initial configuration, the deformation gradient tensor is
know. Typically, an undeformed material state will be prescribed (\(F^0
= I\), where \(I\) is the identity tensor). An explicit forward
difference updating scheme for updating the deformation gradient is
employed as we can see in
</p>

\begin{equation}
  \label{eq:update_defor_grad}
  F^{k+1} = \Delta F^{k+1} F^{k}
\end{equation}



<p>
This way of integrating the deformation gradient, using the grid
velocities, in also employed by \cite{Guilkey2003} and
\cite{love_sulsky_2006}
</p>
</div>
</div>



<div id="outline-container-org5d3a221" class="outline-3">
<h3 id="org5d3a221">Large strain analysis by the material point method}</h3>
<div class="outline-text-3" id="text-org5d3a221">
<ul class="org-ul">
<li>Evaluationg the weighting functions using Gauss</li>

<li>Analytical approximation of the weighting functions</li>

<li>Refinement in the material-point-method</li>

<li>Material-point splitting</li>

<li>Material-point splitting in case of extreme deformations</li>

<li>Refining the computational grid</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Miguel Molinos Pérez</p>
<p class="date">Created: 2019-06-02 dom 19:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
